irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
    CS_CMM_PROBE_NODE_STMT(185,2,2) RCC_APB2PeriphResetCmd(((uint32_t)0x00000800), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00000800), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(185,1,3) if (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x0000)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable877,835) 
    
    CS_CMM_PROBE_NODE_STMT(185,0,4) RCC_APB1PeriphResetCmd(((uint32_t)0x00000001), ENABLE);
    RCC_APB1PeriphResetCmd(((uint32_t)0x00000001), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(186,7,5) if (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x0400)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable878,836) 
    
    CS_CMM_PROBE_NODE_STMT(186,6,6) RCC_APB1PeriphResetCmd(((uint32_t)0x00000002), ENABLE);
    RCC_APB1PeriphResetCmd(((uint32_t)0x00000002), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(186,5,7) if (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x0800)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable879,837) 
    
    CS_CMM_PROBE_NODE_STMT(186,4,8) RCC_APB1PeriphResetCmd(((uint32_t)0x00000004), ENABLE);
    RCC_APB1PeriphResetCmd(((uint32_t)0x00000004), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(186,3,9) if (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x0C00)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable880,838) 
    
    CS_CMM_PROBE_NODE_STMT(186,2,10) RCC_APB1PeriphResetCmd(((uint32_t)0x00000008), ENABLE);
    RCC_APB1PeriphResetCmd(((uint32_t)0x00000008), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(186,1,11) if (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x1000)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable881,839) 
    
    CS_CMM_PROBE_NODE_STMT(186,0,12) RCC_APB1PeriphResetCmd(((uint32_t)0x00000010), ENABLE);
    RCC_APB1PeriphResetCmd(((uint32_t)0x00000010), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(187,7,13) if (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x1400)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable882,840) 
    
    CS_CMM_PROBE_NODE_STMT(187,6,14) RCC_APB1PeriphResetCmd(((uint32_t)0x00000020), ENABLE);
    RCC_APB1PeriphResetCmd(((uint32_t)0x00000020), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(187,5,15) if (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x3400)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable883,841) 
    
    CS_CMM_PROBE_NODE_STMT(187,4,16) RCC_APB2PeriphResetCmd(((uint32_t)0x00002000), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00002000), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(187,3,17) if (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x4C00)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable884,842) 
    
    CS_CMM_PROBE_NODE_STMT(187,2,18) RCC_APB2PeriphResetCmd(((uint32_t)0x00080000), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00080000), DISABLE);
   }
  else { 
  CS_CMM_PROBE_NODE_STMT(187,1,19) if (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x5000)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable885,843) 
    
    CS_CMM_PROBE_NODE_STMT(187,0,20) RCC_APB2PeriphResetCmd(((uint32_t)0x00100000), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00100000), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(188,7,21) if (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x5400)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable886,844) 
    
    CS_CMM_PROBE_NODE_STMT(188,6,22) RCC_APB2PeriphResetCmd(((uint32_t)0x00200000), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00200000), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(188,5,23) if (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x1800)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable887,845) 
    
    CS_CMM_PROBE_NODE_STMT(188,4,24) RCC_APB1PeriphResetCmd(((uint32_t)0x00000040), ENABLE);
    RCC_APB1PeriphResetCmd(((uint32_t)0x00000040), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(188,3,25) if (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x1C00)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable888,846) 
    
    CS_CMM_PROBE_NODE_STMT(188,2,26) RCC_APB1PeriphResetCmd(((uint32_t)0x00000080), ENABLE);
    RCC_APB1PeriphResetCmd(((uint32_t)0x00000080), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(188,1,27) if (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x2000)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable889,847) 
    
    CS_CMM_PROBE_NODE_STMT(188,0,28) RCC_APB1PeriphResetCmd(((uint32_t)0x00000100), ENABLE);
    RCC_APB1PeriphResetCmd(((uint32_t)0x00000100), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(189,7,29) if (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x4000)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable890,848) 
    
    CS_CMM_PROBE_NODE_STMT(189,6,30) RCC_APB2PeriphResetCmd(((uint32_t)0x00010000), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00010000), DISABLE);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(189,5,31) if (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x4400)))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable891,849) 
    
    CS_CMM_PROBE_NODE_STMT(189,4,32) RCC_APB2PeriphResetCmd(((uint32_t)0x00020000), ENABLE);
    RCC_APB2PeriphResetCmd(((uint32_t)0x00020000), DISABLE);
  }
  else
  {
    
    CS_CMM_PROBE_NODE_STMT(189,3,33) if (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x4800)))
    { CS_CMM_PROBE_DECL_C1(CodeScrollVariable892,850) 
      
      CS_CMM_PROBE_NODE_STMT(189,2,34) RCC_APB2PeriphResetCmd(((uint32_t)0x00040000), ENABLE);
      RCC_APB2PeriphResetCmd(((uint32_t)0x00040000), DISABLE);
    } CS_CMM_ELSE_PROBE_C1(851) 
  }
  }
  }
  }
  }
  }
  }
  }
  }
  }
  }
  }
  }
  }
  }
  }

CS_CMM_PROBE_NODE_STMT(189,1,35) 
 CODESCROLL_FUNC_END(346, 22, 214) } CODESCROLL_FUNC_END_RBRACE 
/* # 224 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_TimeBaseInit(TIM_TypeDef* TIMx, TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct)
{ CODESCROLL_FUNC_BEGIN(347, (347, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable893,852) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable894,189,0,0)

  uint16_t tmpcr1 = 0;


  ((void)0);
  ((void)0);
  ((void)0);

  tmpcr1 = TIMx->CR1;

  
  CS_CMM_PROBE_NODE_STMT(190,7,1) if(CS_MCDC_347_0((TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2C00))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x3400))), (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x0000))), (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x0400))), (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x0800))), (TIMx == ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x0C00))), 54))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable895,35) 

    
    CS_CMM_PROBE_NODE_STMT(190,6,2) tmpcr1 &= (uint16_t)(~((uint16_t)(((uint16_t)0x0010) | ((uint16_t)0x0060))));
    tmpcr1 |= (uint32_t)TIM_TimeBaseInitStruct->TIM_CounterMode;
  } CS_CMM_ELSE_PROBE_CX(36) 

  
  CS_CMM_PROBE_NODE_STMT(190,5,3) if(CS_MCDC_347_1((TIMx != ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x1000))), (TIMx != ((TIM_TypeDef *) (((uint32_t)0x40000000) + 0x1400))), 61))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable896,37) 

    
