irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
    CS_CMM_PROBE_NODE_STMT(190,4,4) tmpcr1 &= (uint16_t)(~((uint16_t)((uint16_t)0x0300)));
    tmpcr1 |= (uint32_t)TIM_TimeBaseInitStruct->TIM_ClockDivision;
  } CS_CMM_ELSE_PROBE_CX(38) 

  
  CS_CMM_PROBE_NODE_STMT(190,3,5) TIMx->CR1 = tmpcr1;


  TIMx->ARR = TIM_TimeBaseInitStruct->TIM_Period ;


  TIMx->PSC = TIM_TimeBaseInitStruct->TIM_Prescaler;

  
  CS_CMM_PROBE_NODE_STMT(190,2,6) if (CS_MCDC_347_2((TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2C00))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x3400))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x4000))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x4400))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x4800))), 64))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable897,39) 

    
    CS_CMM_PROBE_NODE_STMT(190,1,7) TIMx->RCR = TIM_TimeBaseInitStruct->TIM_RepetitionCounter;
  } CS_CMM_ELSE_PROBE_CX(40) 



  
  CS_CMM_PROBE_NODE_STMT(190,0,8) TIMx->EGR = ((uint16_t)0x0001);

CS_CMM_PROBE_NODE_STMT(191,7,9) 
 CODESCROLL_FUNC_END(347, 22, 267) } CODESCROLL_FUNC_END_RBRACE 
/* # 277 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC1Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct)
{ CODESCROLL_FUNC_BEGIN(348, (348, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable898,853) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable899,191,6,0)

  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  TIMx->CCER &= (uint16_t)(~(uint16_t)((uint16_t)0x0001));

  tmpccer = TIMx->CCER;

  tmpcr2 = TIMx->CR2;


  tmpccmrx = TIMx->CCMR1;


  tmpccmrx &= (uint16_t)(~((uint16_t)((uint16_t)0x0070)));
  tmpccmrx &= (uint16_t)(~((uint16_t)((uint16_t)0x0003)));


  tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;


  tmpccer &= (uint16_t)(~((uint16_t)((uint16_t)0x0002)));

  tmpccer |= TIM_OCInitStruct->TIM_OCPolarity;


  tmpccer |= TIM_OCInitStruct->TIM_OutputState;

  
  CS_CMM_PROBE_NODE_STMT(191,5,1) if(CS_MCDC_348_0((TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2C00))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x3400))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x4000))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x4400))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x4800))), 70))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable900,41) 
    
    CS_CMM_PROBE_NODE_STMT(191,4,2) ((void)0);
    ((void)0);
    ((void)0);
    ((void)0);


    tmpccer &= (uint16_t)(~((uint16_t)((uint16_t)0x0008)));

    tmpccer |= TIM_OCInitStruct->TIM_OCNPolarity;


    tmpccer &= (uint16_t)(~((uint16_t)((uint16_t)0x0004)));

    tmpccer |= TIM_OCInitStruct->TIM_OutputNState;


    tmpcr2 &= (uint16_t)(~((uint16_t)((uint16_t)0x0100)));
    tmpcr2 &= (uint16_t)(~((uint16_t)((uint16_t)0x0200)));


    tmpcr2 |= TIM_OCInitStruct->TIM_OCIdleState;

    tmpcr2 |= TIM_OCInitStruct->TIM_OCNIdleState;
  } CS_CMM_ELSE_PROBE_CX(42) 

  
  CS_CMM_PROBE_NODE_STMT(191,3,3) TIMx->CR2 = tmpcr2;


  TIMx->CCMR1 = tmpccmrx;


  TIMx->CCR1 = TIM_OCInitStruct->TIM_Pulse;


  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(191,2,4) 
 CODESCROLL_FUNC_END(348, 22, 349) } CODESCROLL_FUNC_END_RBRACE 
/* # 360 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC2Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct)
{ CODESCROLL_FUNC_BEGIN(349, (349, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable901,854) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable902,191,1,0)

  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  TIMx->CCER &= (uint16_t)(~((uint16_t)((uint16_t)0x0010)));


  tmpccer = TIMx->CCER;

  tmpcr2 = TIMx->CR2;


  tmpccmrx = TIMx->CCMR1;


  tmpccmrx &= (uint16_t)(~((uint16_t)((uint16_t)0x7000)));
  tmpccmrx &= (uint16_t)(~((uint16_t)((uint16_t)0x0300)));


  tmpccmrx |= (uint16_t)(TIM_OCInitStruct->TIM_OCMode << 8);


  tmpccer &= (uint16_t)(~((uint16_t)((uint16_t)0x0020)));

  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 4);


  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 4);

  
  CS_CMM_PROBE_NODE_STMT(191,0,1) if(CS_MCDC_349_0((TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2C00))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x3400))), 76))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable903,43) 
    
    CS_CMM_PROBE_NODE_STMT(192,7,2) ((void)0);
    ((void)0);
    ((void)0);
    ((void)0);


    tmpccer &= (uint16_t)(~((uint16_t)((uint16_t)0x0080)));

    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCNPolarity << 4);


    tmpccer &= (uint16_t)(~((uint16_t)((uint16_t)0x0040)));

    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputNState << 4);


    tmpcr2 &= (uint16_t)(~((uint16_t)((uint16_t)0x0400)));
    tmpcr2 &= (uint16_t)(~((uint16_t)((uint16_t)0x0800)));


    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCIdleState << 2);

    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCNIdleState << 2);
  } CS_CMM_ELSE_PROBE_CX(44) 

  
  CS_CMM_PROBE_NODE_STMT(192,6,3) TIMx->CR2 = tmpcr2;


  TIMx->CCMR1 = tmpccmrx;


  TIMx->CCR2 = TIM_OCInitStruct->TIM_Pulse;


  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(192,5,4) 
 CODESCROLL_FUNC_END(349, 22, 432) } CODESCROLL_FUNC_END_RBRACE 
/* # 442 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC3Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct)
{ CODESCROLL_FUNC_BEGIN(350, (350, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable904,855) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable905,192,4,0)

