irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  TIMx->CCER &= (uint16_t)(~((uint16_t)((uint16_t)0x0100)));


  tmpccer = TIMx->CCER;

  tmpcr2 = TIMx->CR2;


  tmpccmrx = TIMx->CCMR2;


  tmpccmrx &= (uint16_t)(~((uint16_t)((uint16_t)0x0070)));
  tmpccmrx &= (uint16_t)(~((uint16_t)((uint16_t)0x0003)));

  tmpccmrx |= TIM_OCInitStruct->TIM_OCMode;


  tmpccer &= (uint16_t)(~((uint16_t)((uint16_t)0x0200)));

  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 8);


  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 8);

  
  CS_CMM_PROBE_NODE_STMT(192,3,1) if(CS_MCDC_350_0((TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2C00))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x3400))), 79))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable906,45) 
    
    CS_CMM_PROBE_NODE_STMT(192,2,2) ((void)0);
    ((void)0);
    ((void)0);
    ((void)0);


    tmpccer &= (uint16_t)(~((uint16_t)((uint16_t)0x0800)));

    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCNPolarity << 8);

    tmpccer &= (uint16_t)(~((uint16_t)((uint16_t)0x0400)));


    tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputNState << 8);

    tmpcr2 &= (uint16_t)(~((uint16_t)((uint16_t)0x1000)));
    tmpcr2 &= (uint16_t)(~((uint16_t)((uint16_t)0x2000)));

    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCIdleState << 4);

    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCNIdleState << 4);
  } CS_CMM_ELSE_PROBE_CX(46) 

  
  CS_CMM_PROBE_NODE_STMT(192,1,3) TIMx->CR2 = tmpcr2;


  TIMx->CCMR2 = tmpccmrx;


  TIMx->CCR3 = TIM_OCInitStruct->TIM_Pulse;


  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(192,0,4) 
 CODESCROLL_FUNC_END(350, 22, 511) } CODESCROLL_FUNC_END_RBRACE 
/* # 521 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC4Init(TIM_TypeDef* TIMx, TIM_OCInitTypeDef* TIM_OCInitStruct)
{ CODESCROLL_FUNC_BEGIN(351, (351, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable907,856) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable908,193,7,0)

  uint16_t tmpccmrx = 0, tmpccer = 0, tmpcr2 = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  TIMx->CCER &= (uint16_t)(~((uint16_t)((uint16_t)0x1000)));


  tmpccer = TIMx->CCER;

  tmpcr2 = TIMx->CR2;


  tmpccmrx = TIMx->CCMR2;


  tmpccmrx &= (uint16_t)(~((uint16_t)((uint16_t)0x7000)));
  tmpccmrx &= (uint16_t)(~((uint16_t)((uint16_t)0x0300)));


  tmpccmrx |= (uint16_t)(TIM_OCInitStruct->TIM_OCMode << 8);


  tmpccer &= (uint16_t)(~((uint16_t)((uint16_t)0x2000)));

  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OCPolarity << 12);


  tmpccer |= (uint16_t)(TIM_OCInitStruct->TIM_OutputState << 12);

  
  CS_CMM_PROBE_NODE_STMT(193,6,1) if(CS_MCDC_351_0((TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x2C00))), (TIMx == ((TIM_TypeDef *) ((((uint32_t)0x40000000) + 0x10000) + 0x3400))), 82))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable909,47) 
    
    CS_CMM_PROBE_NODE_STMT(193,5,2) ((void)0);

    tmpcr2 &= (uint16_t)(~((uint16_t)((uint16_t)0x4000)));

    tmpcr2 |= (uint16_t)(TIM_OCInitStruct->TIM_OCIdleState << 6);
  } CS_CMM_ELSE_PROBE_CX(48) 

  
  CS_CMM_PROBE_NODE_STMT(193,4,3) TIMx->CR2 = tmpcr2;


  TIMx->CCMR2 = tmpccmrx;


  TIMx->CCR4 = TIM_OCInitStruct->TIM_Pulse;


  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(193,3,4) 
 CODESCROLL_FUNC_END(351, 22, 575) } CODESCROLL_FUNC_END_RBRACE 
/* # 585 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ICInit(TIM_TypeDef* TIMx, TIM_ICInitTypeDef* TIM_ICInitStruct)
{ CODESCROLL_FUNC_BEGIN(352, (352, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable910,857) 

  
  CS_CMM_PROBE_NODE_STMT(193,2,0) ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(193,1,1) if (TIM_ICInitStruct->TIM_Channel == ((uint16_t)0x0000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable911,858) 
    
    CS_CMM_PROBE_NODE_STMT(193,0,2) ((void)0);

    TI1_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);

    TIM_SetIC1Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(194,7,3) if (TIM_ICInitStruct->TIM_Channel == ((uint16_t)0x0004))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable912,859) 
    
    CS_CMM_PROBE_NODE_STMT(194,6,4) ((void)0);

    TI2_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);

    TIM_SetIC2Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
  else { 
  CS_CMM_PROBE_NODE_STMT(194,5,5) if (TIM_ICInitStruct->TIM_Channel == ((uint16_t)0x0008))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable913,860) 
    
    CS_CMM_PROBE_NODE_STMT(194,4,6) ((void)0);

    TI3_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);

    TIM_SetIC3Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable914,861) 
    
    CS_CMM_PROBE_NODE_STMT(194,3,7) ((void)0);

    TI4_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity,
               TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);

    TIM_SetIC4Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
  }
  }

CS_CMM_PROBE_NODE_STMT(194,2,8) 
 CODESCROLL_FUNC_END(352, 22, 634) } CODESCROLL_FUNC_END_RBRACE 
/* # 644 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_PWMIConfig(TIM_TypeDef* TIMx, TIM_ICInitTypeDef* TIM_ICInitStruct)
{ CODESCROLL_FUNC_BEGIN(353, (353, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable915,862) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable916,194,1,0)

