irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
  uint16_t icoppositepolarity = ((uint16_t)0x0000);
  uint16_t icoppositeselection = ((uint16_t)0x0001);

  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(194,0,1) if (TIM_ICInitStruct->TIM_ICPolarity == ((uint16_t)0x0000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable917,863) 
    
    CS_CMM_PROBE_NODE_STMT(195,7,2) icoppositepolarity = ((uint16_t)0x0002);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable918,864) 
    
    CS_CMM_PROBE_NODE_STMT(195,6,3) icoppositepolarity = ((uint16_t)0x0000);
  }

  
  CS_CMM_PROBE_NODE_STMT(195,5,4) if (TIM_ICInitStruct->TIM_ICSelection == ((uint16_t)0x0001))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable919,865) 
    
    CS_CMM_PROBE_NODE_STMT(195,4,5) icoppositeselection = ((uint16_t)0x0002);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable920,866) 
    
    CS_CMM_PROBE_NODE_STMT(195,3,6) icoppositeselection = ((uint16_t)0x0001);
  }
  
  CS_CMM_PROBE_NODE_STMT(195,2,7) if (TIM_ICInitStruct->TIM_Channel == ((uint16_t)0x0000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable921,867) 

    
    CS_CMM_PROBE_NODE_STMT(195,1,8) TI1_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity, TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);

    TIM_SetIC1Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);

    TI2_Config(TIMx, icoppositepolarity, icoppositeselection, TIM_ICInitStruct->TIM_ICFilter);

    TIM_SetIC2Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable922,868) 

    
    CS_CMM_PROBE_NODE_STMT(195,0,9) TI2_Config(TIMx, TIM_ICInitStruct->TIM_ICPolarity, TIM_ICInitStruct->TIM_ICSelection,
               TIM_ICInitStruct->TIM_ICFilter);

    TIM_SetIC2Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);

    TI1_Config(TIMx, icoppositepolarity, icoppositeselection, TIM_ICInitStruct->TIM_ICFilter);

    TIM_SetIC1Prescaler(TIMx, TIM_ICInitStruct->TIM_ICPrescaler);
  }

CS_CMM_PROBE_NODE_STMT(196,7,10) 
 CODESCROLL_FUNC_END(353, 22, 692) } CODESCROLL_FUNC_END_RBRACE 
/* # 702 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_BDTRConfig(TIM_TypeDef* TIMx, TIM_BDTRInitTypeDef *TIM_BDTRInitStruct)
{ CODESCROLL_FUNC_BEGIN(354, (354, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable923,869) 

  
  CS_CMM_PROBE_NODE_STMT(196,6,0) ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);


  TIMx->BDTR = (uint32_t)TIM_BDTRInitStruct->TIM_OSSRState | TIM_BDTRInitStruct->TIM_OSSIState |
             TIM_BDTRInitStruct->TIM_LOCKLevel | TIM_BDTRInitStruct->TIM_DeadTime |
             TIM_BDTRInitStruct->TIM_Break | TIM_BDTRInitStruct->TIM_BreakPolarity |
             TIM_BDTRInitStruct->TIM_AutomaticOutput;

CS_CMM_PROBE_NODE_STMT(196,5,1) 
 CODESCROLL_FUNC_END(354, 22, 718) } CODESCROLL_FUNC_END_RBRACE 







void TIM_TimeBaseStructInit(TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct)
{ CODESCROLL_FUNC_BEGIN(355, (355, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable924,870) 

  
  CS_CMM_PROBE_NODE_STMT(196,4,0) TIM_TimeBaseInitStruct->TIM_Period = 0xFFFF;
  TIM_TimeBaseInitStruct->TIM_Prescaler = 0x0000;
  TIM_TimeBaseInitStruct->TIM_ClockDivision = ((uint16_t)0x0000);
  TIM_TimeBaseInitStruct->TIM_CounterMode = ((uint16_t)0x0000);
  TIM_TimeBaseInitStruct->TIM_RepetitionCounter = 0x0000;

CS_CMM_PROBE_NODE_STMT(196,3,1) 
 CODESCROLL_FUNC_END(355, 22, 734) } CODESCROLL_FUNC_END_RBRACE 







void TIM_OCStructInit(TIM_OCInitTypeDef* TIM_OCInitStruct)
{ CODESCROLL_FUNC_BEGIN(356, (356, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable925,871) 

  
  CS_CMM_PROBE_NODE_STMT(196,2,0) TIM_OCInitStruct->TIM_OCMode = ((uint16_t)0x0000);
  TIM_OCInitStruct->TIM_OutputState = ((uint16_t)0x0000);
  TIM_OCInitStruct->TIM_OutputNState = ((uint16_t)0x0000);
  TIM_OCInitStruct->TIM_Pulse = 0x0000;
  TIM_OCInitStruct->TIM_OCPolarity = ((uint16_t)0x0000);
  TIM_OCInitStruct->TIM_OCNPolarity = ((uint16_t)0x0000);
  TIM_OCInitStruct->TIM_OCIdleState = ((uint16_t)0x0000);
  TIM_OCInitStruct->TIM_OCNIdleState = ((uint16_t)0x0000);

CS_CMM_PROBE_NODE_STMT(196,1,1) 
 CODESCROLL_FUNC_END(356, 22, 753) } CODESCROLL_FUNC_END_RBRACE 







void TIM_ICStructInit(TIM_ICInitTypeDef* TIM_ICInitStruct)
{ CODESCROLL_FUNC_BEGIN(357, (357, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable926,872) 

  
  CS_CMM_PROBE_NODE_STMT(196,0,0) TIM_ICInitStruct->TIM_Channel = ((uint16_t)0x0000);
  TIM_ICInitStruct->TIM_ICPolarity = ((uint16_t)0x0000);
  TIM_ICInitStruct->TIM_ICSelection = ((uint16_t)0x0001);
  TIM_ICInitStruct->TIM_ICPrescaler = ((uint16_t)0x0000);
  TIM_ICInitStruct->TIM_ICFilter = 0x00;

CS_CMM_PROBE_NODE_STMT(197,7,1) 
 CODESCROLL_FUNC_END(357, 22, 769) } CODESCROLL_FUNC_END_RBRACE 







void TIM_BDTRStructInit(TIM_BDTRInitTypeDef* TIM_BDTRInitStruct)
{ CODESCROLL_FUNC_BEGIN(358, (358, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable927,873) 

  
  CS_CMM_PROBE_NODE_STMT(197,6,0) TIM_BDTRInitStruct->TIM_OSSRState = ((uint16_t)0x0000);
  TIM_BDTRInitStruct->TIM_OSSIState = ((uint16_t)0x0000);
  TIM_BDTRInitStruct->TIM_LOCKLevel = ((uint16_t)0x0000);
  TIM_BDTRInitStruct->TIM_DeadTime = 0x00;
  TIM_BDTRInitStruct->TIM_Break = ((uint16_t)0x0000);
  TIM_BDTRInitStruct->TIM_BreakPolarity = ((uint16_t)0x0000);
  TIM_BDTRInitStruct->TIM_AutomaticOutput = ((uint16_t)0x0000);

CS_CMM_PROBE_NODE_STMT(197,5,1) 
 CODESCROLL_FUNC_END(358, 22, 787) } CODESCROLL_FUNC_END_RBRACE 
/* # 796 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_Cmd(TIM_TypeDef* TIMx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(359, (359, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable928,874) 

  
  CS_CMM_PROBE_NODE_STMT(197,4,0) ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(197,3,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable929,875) 

    
