irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
    CS_CMM_PROBE_NODE_STMT(197,2,2) TIMx->CR1 |= ((uint16_t)0x0001);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable930,876) 

    
    CS_CMM_PROBE_NODE_STMT(197,1,3) TIMx->CR1 &= (uint16_t)(~((uint16_t)((uint16_t)0x0001)));
  }

CS_CMM_PROBE_NODE_STMT(197,0,4) 
 CODESCROLL_FUNC_END(359, 22, 812) } CODESCROLL_FUNC_END_RBRACE 
/* # 821 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_CtrlPWMOutputs(TIM_TypeDef* TIMx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(360, (360, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable931,877) 

  
  CS_CMM_PROBE_NODE_STMT(198,7,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(198,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable932,878) 

    
    CS_CMM_PROBE_NODE_STMT(198,5,2) TIMx->BDTR |= ((uint16_t)0x8000);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable933,879) 

    
    CS_CMM_PROBE_NODE_STMT(198,4,3) TIMx->BDTR &= (uint16_t)(~((uint16_t)((uint16_t)0x8000)));
  }

CS_CMM_PROBE_NODE_STMT(198,3,4) 
 CODESCROLL_FUNC_END(360, 22, 836) } CODESCROLL_FUNC_END_RBRACE 
/* # 862 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ITConfig(TIM_TypeDef* TIMx, uint16_t TIM_IT, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(361, (361, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable934,880) 

  
  CS_CMM_PROBE_NODE_STMT(198,2,0) ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(198,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable935,881) 

    
    CS_CMM_PROBE_NODE_STMT(198,0,2) TIMx->DIER |= TIM_IT;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable936,882) 

    
    CS_CMM_PROBE_NODE_STMT(199,7,3) TIMx->DIER &= (uint16_t)~TIM_IT;
  }

CS_CMM_PROBE_NODE_STMT(199,6,4) 
 CODESCROLL_FUNC_END(361, 22, 879) } CODESCROLL_FUNC_END_RBRACE 
/* # 899 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_GenerateEvent(TIM_TypeDef* TIMx, uint16_t TIM_EventSource)
{ CODESCROLL_FUNC_BEGIN(362, (362, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable937,883) 

  
  CS_CMM_PROBE_NODE_STMT(199,5,0) ((void)0);
  ((void)0);


  TIMx->EGR = TIM_EventSource;

CS_CMM_PROBE_NODE_STMT(199,4,1) 
 CODESCROLL_FUNC_END(362, 22, 907) } CODESCROLL_FUNC_END_RBRACE 
/* # 927 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_DMAConfig(TIM_TypeDef* TIMx, uint16_t TIM_DMABase, uint16_t TIM_DMABurstLength)
{ CODESCROLL_FUNC_BEGIN(363, (363, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable938,884) 

  
  CS_CMM_PROBE_NODE_STMT(199,3,0) ((void)0);
  ((void)0);
  ((void)0);

  TIMx->DCR = TIM_DMABase | TIM_DMABurstLength;

CS_CMM_PROBE_NODE_STMT(199,2,1) 
 CODESCROLL_FUNC_END(363, 22, 935) } CODESCROLL_FUNC_END_RBRACE 
/* # 954 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_DMACmd(TIM_TypeDef* TIMx, uint16_t TIM_DMASource, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(364, (364, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable939,885) 

  
  CS_CMM_PROBE_NODE_STMT(199,1,0) ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(199,0,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable940,886) 

    
    CS_CMM_PROBE_NODE_STMT(200,7,2) TIMx->DIER |= TIM_DMASource;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable941,887) 

    
    CS_CMM_PROBE_NODE_STMT(200,6,3) TIMx->DIER &= (uint16_t)~TIM_DMASource;
  }

CS_CMM_PROBE_NODE_STMT(200,5,4) 
 CODESCROLL_FUNC_END(364, 22, 971) } CODESCROLL_FUNC_END_RBRACE 







void TIM_InternalClockConfig(TIM_TypeDef* TIMx)
{ CODESCROLL_FUNC_BEGIN(365, (365, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable942,888) 

  
  CS_CMM_PROBE_NODE_STMT(200,4,0) ((void)0);

  TIMx->SMCR &= (uint16_t)(~((uint16_t)((uint16_t)0x0007)));

CS_CMM_PROBE_NODE_STMT(200,3,1) 
 CODESCROLL_FUNC_END(365, 22, 985) } CODESCROLL_FUNC_END_RBRACE 
/* # 998 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ITRxExternalClockConfig(TIM_TypeDef* TIMx, uint16_t TIM_InputTriggerSource)
{ CODESCROLL_FUNC_BEGIN(366, (366, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable943,889) 

  
  CS_CMM_PROBE_NODE_STMT(200,2,0) ((void)0);
  ((void)0);

  TIM_SelectInputTrigger(TIMx, TIM_InputTriggerSource);

  TIMx->SMCR |= ((uint16_t)0x0007);

CS_CMM_PROBE_NODE_STMT(200,1,1) 
 CODESCROLL_FUNC_END(366, 22, 1007) } CODESCROLL_FUNC_END_RBRACE 
/* # 1025 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_TIxExternalClockConfig(TIM_TypeDef* TIMx, uint16_t TIM_TIxExternalCLKSource,
                                uint16_t TIM_ICPolarity, uint16_t ICFilter)
{ CODESCROLL_FUNC_BEGIN(367, (367, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable944,890) 

  
  CS_CMM_PROBE_NODE_STMT(200,0,0) ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(201,7,1) if (TIM_TIxExternalCLKSource == ((uint16_t)0x0060))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable945,891) 
    
    CS_CMM_PROBE_NODE_STMT(201,6,2) TI2_Config(TIMx, TIM_ICPolarity, ((uint16_t)0x0001), ICFilter);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable946,892) 
    
    CS_CMM_PROBE_NODE_STMT(201,5,3) TI1_Config(TIMx, TIM_ICPolarity, ((uint16_t)0x0001), ICFilter);
  }

  
