irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
  CS_CMM_PROBE_NODE_STMT(201,4,4) TIM_SelectInputTrigger(TIMx, TIM_TIxExternalCLKSource);

  TIMx->SMCR |= ((uint16_t)0x0007);

CS_CMM_PROBE_NODE_STMT(201,3,5) 
 CODESCROLL_FUNC_END(367, 22, 1046) } CODESCROLL_FUNC_END_RBRACE 
/* # 1065 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ETRClockMode1Config(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                             uint16_t ExtTRGFilter)
{ CODESCROLL_FUNC_BEGIN(368, (368, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable947,893) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable948,201,2,0)

  uint16_t tmpsmcr = 0;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  TIM_ETRConfig(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);


  tmpsmcr = TIMx->SMCR;

  tmpsmcr &= (uint16_t)(~((uint16_t)((uint16_t)0x0007)));

  tmpsmcr |= ((uint16_t)0x0007);

  tmpsmcr &= (uint16_t)(~((uint16_t)((uint16_t)0x0070)));
  tmpsmcr |= ((uint16_t)0x0070);

  TIMx->SMCR = tmpsmcr;

CS_CMM_PROBE_NODE_STMT(201,1,1) 
 CODESCROLL_FUNC_END(368, 22, 1088) } CODESCROLL_FUNC_END_RBRACE 
/* # 1107 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ETRClockMode2Config(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler,
                             uint16_t TIM_ExtTRGPolarity, uint16_t ExtTRGFilter)
{ CODESCROLL_FUNC_BEGIN(369, (369, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable949,894) 

  
  CS_CMM_PROBE_NODE_STMT(201,0,0) ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);

  TIM_ETRConfig(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter);

  TIMx->SMCR |= ((uint16_t)0x4000);

CS_CMM_PROBE_NODE_STMT(202,7,1) 
 CODESCROLL_FUNC_END(369, 22, 1119) } CODESCROLL_FUNC_END_RBRACE 
/* # 1138 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ETRConfig(TIM_TypeDef* TIMx, uint16_t TIM_ExtTRGPrescaler, uint16_t TIM_ExtTRGPolarity,
                   uint16_t ExtTRGFilter)
{ CODESCROLL_FUNC_BEGIN(370, (370, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable950,895) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable951,202,6,0)

  uint16_t tmpsmcr = 0;

  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);
  tmpsmcr = TIMx->SMCR;

  tmpsmcr &= ((uint16_t)0x00FF);

  tmpsmcr |= (uint16_t)(TIM_ExtTRGPrescaler | (uint16_t)(TIM_ExtTRGPolarity | (uint16_t)(ExtTRGFilter << (uint16_t)8)));

  TIMx->SMCR = tmpsmcr;

CS_CMM_PROBE_NODE_STMT(202,5,1) 
 CODESCROLL_FUNC_END(370, 22, 1154) } CODESCROLL_FUNC_END_RBRACE 
/* # 1166 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_PrescalerConfig(TIM_TypeDef* TIMx, uint16_t Prescaler, uint16_t TIM_PSCReloadMode)
{ CODESCROLL_FUNC_BEGIN(371, (371, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable952,896) 

  
  CS_CMM_PROBE_NODE_STMT(202,4,0) ((void)0);
  ((void)0);

  TIMx->PSC = Prescaler;

  TIMx->EGR = TIM_PSCReloadMode;

CS_CMM_PROBE_NODE_STMT(202,3,1) 
 CODESCROLL_FUNC_END(371, 22, 1175) } CODESCROLL_FUNC_END_RBRACE 
/* # 1189 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_CounterModeConfig(TIM_TypeDef* TIMx, uint16_t TIM_CounterMode)
{ CODESCROLL_FUNC_BEGIN(372, (372, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable953,897) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable954,202,2,0)

  uint16_t tmpcr1 = 0;

  ((void)0);
  ((void)0);
  tmpcr1 = TIMx->CR1;

  tmpcr1 &= (uint16_t)(~((uint16_t)(((uint16_t)0x0010) | ((uint16_t)0x0060))));

  tmpcr1 |= TIM_CounterMode;

  TIMx->CR1 = tmpcr1;

CS_CMM_PROBE_NODE_STMT(202,1,1) 
 CODESCROLL_FUNC_END(372, 22, 1202) } CODESCROLL_FUNC_END_RBRACE 
/* # 1219 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SelectInputTrigger(TIM_TypeDef* TIMx, uint16_t TIM_InputTriggerSource)
{ CODESCROLL_FUNC_BEGIN(373, (373, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable955,898) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable956,202,0,0)

  uint16_t tmpsmcr = 0;

  ((void)0);
  ((void)0);

  tmpsmcr = TIMx->SMCR;

  tmpsmcr &= (uint16_t)(~((uint16_t)((uint16_t)0x0070)));

  tmpsmcr |= TIM_InputTriggerSource;

  TIMx->SMCR = tmpsmcr;

CS_CMM_PROBE_NODE_STMT(203,7,1) 
 CODESCROLL_FUNC_END(373, 22, 1233) } CODESCROLL_FUNC_END_RBRACE 
/* # 1254 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_EncoderInterfaceConfig(TIM_TypeDef* TIMx, uint16_t TIM_EncoderMode,
                                uint16_t TIM_IC1Polarity, uint16_t TIM_IC2Polarity)
{ CODESCROLL_FUNC_BEGIN(374, (374, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable957,899) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable958,203,6,0)

  uint16_t tmpsmcr = 0;
  uint16_t tmpccmr1 = 0;
  uint16_t tmpccer = 0;


  ((void)0);
  ((void)0);
  ((void)0);
  ((void)0);


  tmpsmcr = TIMx->SMCR;


  tmpccmr1 = TIMx->CCMR1;


  tmpccer = TIMx->CCER;


  tmpsmcr &= (uint16_t)(~((uint16_t)((uint16_t)0x0007)));
  tmpsmcr |= TIM_EncoderMode;


  tmpccmr1 &= (uint16_t)(((uint16_t)~((uint16_t)((uint16_t)0x0003))) & (uint16_t)(~((uint16_t)((uint16_t)0x0300))));
  tmpccmr1 |= ((uint16_t)0x0001) | ((uint16_t)0x0100);


  tmpccer &= (uint16_t)(((uint16_t)~((uint16_t)((uint16_t)0x0002))) & ((uint16_t)~((uint16_t)((uint16_t)0x0020))));
  tmpccer |= (uint16_t)(TIM_IC1Polarity | (uint16_t)(TIM_IC2Polarity << (uint16_t)4));


  TIMx->SMCR = tmpsmcr;

  TIMx->CCMR1 = tmpccmr1;

