irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(203,5,1) 
 CODESCROLL_FUNC_END(374, 22, 1294) } CODESCROLL_FUNC_END_RBRACE 
/* # 1305 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ForcedOC1Config(TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction)
{ CODESCROLL_FUNC_BEGIN(375, (375, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable959,900) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable960,203,4,0)

  uint16_t tmpccmr1 = 0;

  ((void)0);
  ((void)0);
  tmpccmr1 = TIMx->CCMR1;

  tmpccmr1 &= (uint16_t)~((uint16_t)((uint16_t)0x0070));

  tmpccmr1 |= TIM_ForcedAction;

  TIMx->CCMR1 = tmpccmr1;

CS_CMM_PROBE_NODE_STMT(203,3,1) 
 CODESCROLL_FUNC_END(375, 22, 1318) } CODESCROLL_FUNC_END_RBRACE 
/* # 1329 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ForcedOC2Config(TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction)
{ CODESCROLL_FUNC_BEGIN(376, (376, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable961,901) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable962,203,2,0)

  uint16_t tmpccmr1 = 0;

  ((void)0);
  ((void)0);
  tmpccmr1 = TIMx->CCMR1;

  tmpccmr1 &= (uint16_t)~((uint16_t)((uint16_t)0x7000));

  tmpccmr1 |= (uint16_t)(TIM_ForcedAction << 8);

  TIMx->CCMR1 = tmpccmr1;

CS_CMM_PROBE_NODE_STMT(203,1,1) 
 CODESCROLL_FUNC_END(376, 22, 1342) } CODESCROLL_FUNC_END_RBRACE 
/* # 1353 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ForcedOC3Config(TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction)
{ CODESCROLL_FUNC_BEGIN(377, (377, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable963,902) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable964,203,0,0)

  uint16_t tmpccmr2 = 0;

  ((void)0);
  ((void)0);
  tmpccmr2 = TIMx->CCMR2;

  tmpccmr2 &= (uint16_t)~((uint16_t)((uint16_t)0x0070));

  tmpccmr2 |= TIM_ForcedAction;

  TIMx->CCMR2 = tmpccmr2;

CS_CMM_PROBE_NODE_STMT(204,7,1) 
 CODESCROLL_FUNC_END(377, 22, 1366) } CODESCROLL_FUNC_END_RBRACE 
/* # 1377 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ForcedOC4Config(TIM_TypeDef* TIMx, uint16_t TIM_ForcedAction)
{ CODESCROLL_FUNC_BEGIN(378, (378, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable965,903) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable966,204,6,0)

  uint16_t tmpccmr2 = 0;

  ((void)0);
  ((void)0);
  tmpccmr2 = TIMx->CCMR2;

  tmpccmr2 &= (uint16_t)~((uint16_t)((uint16_t)0x7000));

  tmpccmr2 |= (uint16_t)(TIM_ForcedAction << 8);

  TIMx->CCMR2 = tmpccmr2;

CS_CMM_PROBE_NODE_STMT(204,5,1) 
 CODESCROLL_FUNC_END(378, 22, 1390) } CODESCROLL_FUNC_END_RBRACE 
/* # 1399 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ARRPreloadConfig(TIM_TypeDef* TIMx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(379, (379, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable967,904) 

  
  CS_CMM_PROBE_NODE_STMT(204,4,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(204,3,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable968,905) 

    
    CS_CMM_PROBE_NODE_STMT(204,2,2) TIMx->CR1 |= ((uint16_t)0x0080);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable969,906) 

    
    CS_CMM_PROBE_NODE_STMT(204,1,3) TIMx->CR1 &= (uint16_t)~((uint16_t)((uint16_t)0x0080));
  }

CS_CMM_PROBE_NODE_STMT(204,0,4) 
 CODESCROLL_FUNC_END(379, 22, 1414) } CODESCROLL_FUNC_END_RBRACE 
/* # 1423 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SelectCOM(TIM_TypeDef* TIMx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(380, (380, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable970,907) 

  
  CS_CMM_PROBE_NODE_STMT(205,7,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(205,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable971,908) 

    
    CS_CMM_PROBE_NODE_STMT(205,5,2) TIMx->CR2 |= ((uint16_t)0x0004);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable972,909) 

    
    CS_CMM_PROBE_NODE_STMT(205,4,3) TIMx->CR2 &= (uint16_t)~((uint16_t)((uint16_t)0x0004));
  }

CS_CMM_PROBE_NODE_STMT(205,3,4) 
 CODESCROLL_FUNC_END(380, 22, 1438) } CODESCROLL_FUNC_END_RBRACE 
/* # 1448 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SelectCCDMA(TIM_TypeDef* TIMx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(381, (381, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable973,910) 

  
  CS_CMM_PROBE_NODE_STMT(205,2,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(205,1,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable974,911) 

    
    CS_CMM_PROBE_NODE_STMT(205,0,2) TIMx->CR2 |= ((uint16_t)0x0008);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable975,912) 

    
    CS_CMM_PROBE_NODE_STMT(206,7,3) TIMx->CR2 &= (uint16_t)~((uint16_t)((uint16_t)0x0008));
  }

CS_CMM_PROBE_NODE_STMT(206,6,4) 
 CODESCROLL_FUNC_END(381, 22, 1463) } CODESCROLL_FUNC_END_RBRACE 
/* # 1473 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_CCPreloadControl(TIM_TypeDef* TIMx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(382, (382, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable976,913) 

  
