irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
  CS_CMM_PROBE_NODE_STMT(206,5,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(206,4,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable977,914) 

    
    CS_CMM_PROBE_NODE_STMT(206,3,2) TIMx->CR2 |= ((uint16_t)0x0001);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable978,915) 

    
    CS_CMM_PROBE_NODE_STMT(206,2,3) TIMx->CR2 &= (uint16_t)~((uint16_t)((uint16_t)0x0001));
  }

CS_CMM_PROBE_NODE_STMT(206,1,4) 
 CODESCROLL_FUNC_END(382, 22, 1488) } CODESCROLL_FUNC_END_RBRACE 
/* # 1499 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC1PreloadConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPreload)
{ CODESCROLL_FUNC_BEGIN(383, (383, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable979,916) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable980,206,0,0)

  uint16_t tmpccmr1 = 0;

  ((void)0);
  ((void)0);
  tmpccmr1 = TIMx->CCMR1;

  tmpccmr1 &= (uint16_t)~((uint16_t)((uint16_t)0x0008));

  tmpccmr1 |= TIM_OCPreload;

  TIMx->CCMR1 = tmpccmr1;

CS_CMM_PROBE_NODE_STMT(207,7,1) 
 CODESCROLL_FUNC_END(383, 22, 1512) } CODESCROLL_FUNC_END_RBRACE 
/* # 1524 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC2PreloadConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPreload)
{ CODESCROLL_FUNC_BEGIN(384, (384, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable981,917) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable982,207,6,0)

  uint16_t tmpccmr1 = 0;

  ((void)0);
  ((void)0);
  tmpccmr1 = TIMx->CCMR1;

  tmpccmr1 &= (uint16_t)~((uint16_t)((uint16_t)0x0800));

  tmpccmr1 |= (uint16_t)(TIM_OCPreload << 8);

  TIMx->CCMR1 = tmpccmr1;

CS_CMM_PROBE_NODE_STMT(207,5,1) 
 CODESCROLL_FUNC_END(384, 22, 1537) } CODESCROLL_FUNC_END_RBRACE 
/* # 1548 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC3PreloadConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPreload)
{ CODESCROLL_FUNC_BEGIN(385, (385, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable983,918) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable984,207,4,0)

  uint16_t tmpccmr2 = 0;

  ((void)0);
  ((void)0);
  tmpccmr2 = TIMx->CCMR2;

  tmpccmr2 &= (uint16_t)~((uint16_t)((uint16_t)0x0008));

  tmpccmr2 |= TIM_OCPreload;

  TIMx->CCMR2 = tmpccmr2;

CS_CMM_PROBE_NODE_STMT(207,3,1) 
 CODESCROLL_FUNC_END(385, 22, 1561) } CODESCROLL_FUNC_END_RBRACE 
/* # 1572 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC4PreloadConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPreload)
{ CODESCROLL_FUNC_BEGIN(386, (386, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable985,919) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable986,207,2,0)

  uint16_t tmpccmr2 = 0;

  ((void)0);
  ((void)0);
  tmpccmr2 = TIMx->CCMR2;

  tmpccmr2 &= (uint16_t)~((uint16_t)((uint16_t)0x0800));

  tmpccmr2 |= (uint16_t)(TIM_OCPreload << 8);

  TIMx->CCMR2 = tmpccmr2;

CS_CMM_PROBE_NODE_STMT(207,1,1) 
 CODESCROLL_FUNC_END(386, 22, 1585) } CODESCROLL_FUNC_END_RBRACE 
/* # 1596 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC1FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast)
{ CODESCROLL_FUNC_BEGIN(387, (387, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable987,920) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable988,207,0,0)

  uint16_t tmpccmr1 = 0;

  ((void)0);
  ((void)0);

  tmpccmr1 = TIMx->CCMR1;

  tmpccmr1 &= (uint16_t)~((uint16_t)((uint16_t)0x0004));

  tmpccmr1 |= TIM_OCFast;

  TIMx->CCMR1 = tmpccmr1;

CS_CMM_PROBE_NODE_STMT(208,7,1) 
 CODESCROLL_FUNC_END(387, 22, 1610) } CODESCROLL_FUNC_END_RBRACE 
/* # 1622 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC2FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast)
{ CODESCROLL_FUNC_BEGIN(388, (388, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable989,921) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable990,208,6,0)

  uint16_t tmpccmr1 = 0;

  ((void)0);
  ((void)0);

  tmpccmr1 = TIMx->CCMR1;

  tmpccmr1 &= (uint16_t)~((uint16_t)((uint16_t)0x0400));

  tmpccmr1 |= (uint16_t)(TIM_OCFast << 8);

  TIMx->CCMR1 = tmpccmr1;

CS_CMM_PROBE_NODE_STMT(208,5,1) 
 CODESCROLL_FUNC_END(388, 22, 1636) } CODESCROLL_FUNC_END_RBRACE 
/* # 1647 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC3FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast)
{ CODESCROLL_FUNC_BEGIN(389, (389, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable991,922) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable992,208,4,0)

  uint16_t tmpccmr2 = 0;

  ((void)0);
  ((void)0);

  tmpccmr2 = TIMx->CCMR2;

  tmpccmr2 &= (uint16_t)~((uint16_t)((uint16_t)0x0004));

  tmpccmr2 |= TIM_OCFast;

  TIMx->CCMR2 = tmpccmr2;

CS_CMM_PROBE_NODE_STMT(208,3,1) 
 CODESCROLL_FUNC_END(389, 22, 1661) } CODESCROLL_FUNC_END_RBRACE 
/* # 1672 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC4FastConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCFast)
{ CODESCROLL_FUNC_BEGIN(390, (390, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable993,923) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable994,208,2,0)

  uint16_t tmpccmr2 = 0;

  ((void)0);
  ((void)0);

  tmpccmr2 = TIMx->CCMR2;

  tmpccmr2 &= (uint16_t)~((uint16_t)((uint16_t)0x0400));

  tmpccmr2 |= (uint16_t)(TIM_OCFast << 8);

