irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
  TIMx->CCMR2 = tmpccmr2;

CS_CMM_PROBE_NODE_STMT(208,1,1) 
 CODESCROLL_FUNC_END(390, 22, 1686) } CODESCROLL_FUNC_END_RBRACE 
/* # 1697 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ClearOC1Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear)
{ CODESCROLL_FUNC_BEGIN(391, (391, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable995,924) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable996,208,0,0)

  uint16_t tmpccmr1 = 0;

  ((void)0);
  ((void)0);

  tmpccmr1 = TIMx->CCMR1;


  tmpccmr1 &= (uint16_t)~((uint16_t)((uint16_t)0x0080));

  tmpccmr1 |= TIM_OCClear;

  TIMx->CCMR1 = tmpccmr1;

CS_CMM_PROBE_NODE_STMT(209,7,1) 
 CODESCROLL_FUNC_END(391, 22, 1712) } CODESCROLL_FUNC_END_RBRACE 
/* # 1723 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ClearOC2Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear)
{ CODESCROLL_FUNC_BEGIN(392, (392, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable997,925) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable998,209,6,0)

  uint16_t tmpccmr1 = 0;

  ((void)0);
  ((void)0);
  tmpccmr1 = TIMx->CCMR1;

  tmpccmr1 &= (uint16_t)~((uint16_t)((uint16_t)0x8000));

  tmpccmr1 |= (uint16_t)(TIM_OCClear << 8);

  TIMx->CCMR1 = tmpccmr1;

CS_CMM_PROBE_NODE_STMT(209,5,1) 
 CODESCROLL_FUNC_END(392, 22, 1736) } CODESCROLL_FUNC_END_RBRACE 
/* # 1747 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ClearOC3Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear)
{ CODESCROLL_FUNC_BEGIN(393, (393, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable999,926) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1000,209,4,0)

  uint16_t tmpccmr2 = 0;

  ((void)0);
  ((void)0);
  tmpccmr2 = TIMx->CCMR2;

  tmpccmr2 &= (uint16_t)~((uint16_t)((uint16_t)0x0080));

  tmpccmr2 |= TIM_OCClear;

  TIMx->CCMR2 = tmpccmr2;

CS_CMM_PROBE_NODE_STMT(209,3,1) 
 CODESCROLL_FUNC_END(393, 22, 1760) } CODESCROLL_FUNC_END_RBRACE 
/* # 1771 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ClearOC4Ref(TIM_TypeDef* TIMx, uint16_t TIM_OCClear)
{ CODESCROLL_FUNC_BEGIN(394, (394, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1001,927) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1002,209,2,0)

  uint16_t tmpccmr2 = 0;

  ((void)0);
  ((void)0);
  tmpccmr2 = TIMx->CCMR2;

  tmpccmr2 &= (uint16_t)~((uint16_t)((uint16_t)0x8000));

  tmpccmr2 |= (uint16_t)(TIM_OCClear << 8);

  TIMx->CCMR2 = tmpccmr2;

CS_CMM_PROBE_NODE_STMT(209,1,1) 
 CODESCROLL_FUNC_END(394, 22, 1784) } CODESCROLL_FUNC_END_RBRACE 
/* # 1795 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC1PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity)
{ CODESCROLL_FUNC_BEGIN(395, (395, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1003,928) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1004,209,0,0)

  uint16_t tmpccer = 0;

  ((void)0);
  ((void)0);
  tmpccer = TIMx->CCER;

  tmpccer &= (uint16_t)~((uint16_t)((uint16_t)0x0002));
  tmpccer |= TIM_OCPolarity;

  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(210,7,1) 
 CODESCROLL_FUNC_END(395, 22, 1807) } CODESCROLL_FUNC_END_RBRACE 
/* # 1818 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC1NPolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity)
{ CODESCROLL_FUNC_BEGIN(396, (396, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1005,929) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1006,210,6,0)

  uint16_t tmpccer = 0;

  ((void)0);
  ((void)0);

  tmpccer = TIMx->CCER;

  tmpccer &= (uint16_t)~((uint16_t)((uint16_t)0x0008));
  tmpccer |= TIM_OCNPolarity;

  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(210,5,1) 
 CODESCROLL_FUNC_END(396, 22, 1831) } CODESCROLL_FUNC_END_RBRACE 
/* # 1842 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC2PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity)
{ CODESCROLL_FUNC_BEGIN(397, (397, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1007,930) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1008,210,4,0)

  uint16_t tmpccer = 0;

  ((void)0);
  ((void)0);
  tmpccer = TIMx->CCER;

  tmpccer &= (uint16_t)~((uint16_t)((uint16_t)0x0020));
  tmpccer |= (uint16_t)(TIM_OCPolarity << 4);

  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(210,3,1) 
 CODESCROLL_FUNC_END(397, 22, 1854) } CODESCROLL_FUNC_END_RBRACE 
/* # 1865 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC2NPolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity)
{ CODESCROLL_FUNC_BEGIN(398, (398, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1009,931) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1010,210,2,0)

  uint16_t tmpccer = 0;

  ((void)0);
  ((void)0);

  tmpccer = TIMx->CCER;

  tmpccer &= (uint16_t)~((uint16_t)((uint16_t)0x0080));
  tmpccer |= (uint16_t)(TIM_OCNPolarity << 4);

  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(210,1,1) 
 CODESCROLL_FUNC_END(398, 22, 1878) } CODESCROLL_FUNC_END_RBRACE 
/* # 1889 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC3PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity)
{ CODESCROLL_FUNC_BEGIN(399, (399, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1011,932) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1012,210,0,0)

  uint16_t tmpccer = 0;

  ((void)0);
  ((void)0);
  tmpccer = TIMx->CCER;

  tmpccer &= (uint16_t)~((uint16_t)((uint16_t)0x0200));
  tmpccer |= (uint16_t)(TIM_OCPolarity << 8);

