irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(211,7,1) 
 CODESCROLL_FUNC_END(399, 22, 1901) } CODESCROLL_FUNC_END_RBRACE 
/* # 1912 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC3NPolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCNPolarity)
{ CODESCROLL_FUNC_BEGIN(400, (400, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1013,933) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1014,211,6,0)

  uint16_t tmpccer = 0;


  ((void)0);
  ((void)0);

  tmpccer = TIMx->CCER;

  tmpccer &= (uint16_t)~((uint16_t)((uint16_t)0x0800));
  tmpccer |= (uint16_t)(TIM_OCNPolarity << 8);

  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(211,5,1) 
 CODESCROLL_FUNC_END(400, 22, 1926) } CODESCROLL_FUNC_END_RBRACE 
/* # 1937 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_OC4PolarityConfig(TIM_TypeDef* TIMx, uint16_t TIM_OCPolarity)
{ CODESCROLL_FUNC_BEGIN(401, (401, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1015,934) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1016,211,4,0)

  uint16_t tmpccer = 0;

  ((void)0);
  ((void)0);
  tmpccer = TIMx->CCER;

  tmpccer &= (uint16_t)~((uint16_t)((uint16_t)0x2000));
  tmpccer |= (uint16_t)(TIM_OCPolarity << 12);

  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(211,3,1) 
 CODESCROLL_FUNC_END(401, 22, 1949) } CODESCROLL_FUNC_END_RBRACE 
/* # 1964 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_CCxCmd(TIM_TypeDef* TIMx, uint16_t TIM_Channel, uint16_t TIM_CCx)
{ CODESCROLL_FUNC_BEGIN(402, (402, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1017,935) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1018,211,2,0)

  uint16_t tmp = 0;


  ((void)0);
  ((void)0);
  ((void)0);

  tmp = ((uint16_t)0x0001) << TIM_Channel;


  TIMx->CCER &= (uint16_t)~ tmp;


  TIMx->CCER |= (uint16_t)(TIM_CCx << TIM_Channel);

CS_CMM_PROBE_NODE_STMT(211,1,1) 
 CODESCROLL_FUNC_END(402, 22, 1980) } CODESCROLL_FUNC_END_RBRACE 
/* # 1994 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_CCxNCmd(TIM_TypeDef* TIMx, uint16_t TIM_Channel, uint16_t TIM_CCxN)
{ CODESCROLL_FUNC_BEGIN(403, (403, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1019,936) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1020,211,0,0)

  uint16_t tmp = 0;


  ((void)0);
  ((void)0);
  ((void)0);

  tmp = ((uint16_t)0x0004) << TIM_Channel;


  TIMx->CCER &= (uint16_t) ~tmp;


  TIMx->CCER |= (uint16_t)(TIM_CCxN << TIM_Channel);

CS_CMM_PROBE_NODE_STMT(212,7,1) 
 CODESCROLL_FUNC_END(403, 22, 2010) } CODESCROLL_FUNC_END_RBRACE 
/* # 2035 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SelectOCxM(TIM_TypeDef* TIMx, uint16_t TIM_Channel, uint16_t TIM_OCMode)
{ CODESCROLL_FUNC_BEGIN(404, (404, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1021,937) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1022,212,6,0)

  uint32_t tmp = 0;
  uint16_t tmp1 = 0;


  ((void)0);
  ((void)0);
  ((void)0);

  tmp = (uint32_t) TIMx;
  tmp += ((uint16_t)0x0018);

  tmp1 = ((uint16_t)0x0001) << (uint16_t)TIM_Channel;


  TIMx->CCER &= (uint16_t) ~tmp1;

  
  CS_CMM_PROBE_NODE_STMT(212,5,1) if(CS_MCDC_404_0((TIM_Channel == ((uint16_t)0x0000)), (TIM_Channel == ((uint16_t)0x0008)), 85))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable1023,49) 
    
    CS_CMM_PROBE_NODE_STMT(212,4,2) tmp += (TIM_Channel>>1);


    *(volatile uint32_t *) tmp &= (uint32_t)~((uint32_t)((uint16_t)0x0070));


    *(volatile uint32_t *) tmp |= TIM_OCMode;
  }
  else
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable1024,50) 
    
    CS_CMM_PROBE_NODE_STMT(212,3,3) tmp += (uint16_t)(TIM_Channel - (uint16_t)4)>> (uint16_t)1;


    *(volatile uint32_t *) tmp &= (uint32_t)~((uint32_t)((uint16_t)0x7000));


    *(volatile uint32_t *) tmp |= (uint16_t)(TIM_OCMode << 8);
  }

CS_CMM_PROBE_NODE_STMT(212,2,4) 
 CODESCROLL_FUNC_END(404, 22, 2073) } CODESCROLL_FUNC_END_RBRACE 
/* # 2082 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_UpdateDisableConfig(TIM_TypeDef* TIMx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(405, (405, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1025,938) 

  
  CS_CMM_PROBE_NODE_STMT(212,1,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(212,0,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1026,939) 

    
    CS_CMM_PROBE_NODE_STMT(213,7,2) TIMx->CR1 |= ((uint16_t)0x0002);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1027,940) 

    
    CS_CMM_PROBE_NODE_STMT(213,6,3) TIMx->CR1 &= (uint16_t)~((uint16_t)((uint16_t)0x0002));
  }

CS_CMM_PROBE_NODE_STMT(213,5,4) 
 CODESCROLL_FUNC_END(405, 22, 2097) } CODESCROLL_FUNC_END_RBRACE 
/* # 2110 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_UpdateRequestConfig(TIM_TypeDef* TIMx, uint16_t TIM_UpdateSource)
{ CODESCROLL_FUNC_BEGIN(406, (406, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1028,941) 

  
  CS_CMM_PROBE_NODE_STMT(213,4,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(213,3,1) if (TIM_UpdateSource != ((uint16_t)0x0000))
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1029,942) 

    
    CS_CMM_PROBE_NODE_STMT(213,2,2) TIMx->CR1 |= ((uint16_t)0x0004);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1030,943) 

    
