irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
    CS_CMM_PROBE_NODE_STMT(213,1,3) TIMx->CR1 &= (uint16_t)~((uint16_t)((uint16_t)0x0004));
  }

CS_CMM_PROBE_NODE_STMT(213,0,4) 
 CODESCROLL_FUNC_END(406, 22, 2125) } CODESCROLL_FUNC_END_RBRACE 
/* # 2134 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SelectHallSensor(TIM_TypeDef* TIMx, FunctionalState NewState)
{ CODESCROLL_FUNC_BEGIN(407, (407, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1031,944) 

  
  CS_CMM_PROBE_NODE_STMT(214,7,0) ((void)0);
  ((void)0);
  
  CS_CMM_PROBE_NODE_STMT(214,6,1) if (NewState != DISABLE)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1032,945) 

    
    CS_CMM_PROBE_NODE_STMT(214,5,2) TIMx->CR2 |= ((uint16_t)0x0080);
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1033,946) 

    
    CS_CMM_PROBE_NODE_STMT(214,4,3) TIMx->CR2 &= (uint16_t)~((uint16_t)((uint16_t)0x0080));
  }

CS_CMM_PROBE_NODE_STMT(214,3,4) 
 CODESCROLL_FUNC_END(407, 22, 2149) } CODESCROLL_FUNC_END_RBRACE 
/* # 2160 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SelectOnePulseMode(TIM_TypeDef* TIMx, uint16_t TIM_OPMode)
{ CODESCROLL_FUNC_BEGIN(408, (408, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1034,947) 

  
  CS_CMM_PROBE_NODE_STMT(214,2,0) ((void)0);
  ((void)0);

  TIMx->CR1 &= (uint16_t)~((uint16_t)((uint16_t)0x0008));

  TIMx->CR1 |= TIM_OPMode;

CS_CMM_PROBE_NODE_STMT(214,1,1) 
 CODESCROLL_FUNC_END(408, 22, 2169) } CODESCROLL_FUNC_END_RBRACE 
/* # 2192 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SelectOutputTrigger(TIM_TypeDef* TIMx, uint16_t TIM_TRGOSource)
{ CODESCROLL_FUNC_BEGIN(409, (409, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1035,948) 

  
  CS_CMM_PROBE_NODE_STMT(214,0,0) ((void)0);
  ((void)0);

  TIMx->CR2 &= (uint16_t)~((uint16_t)((uint16_t)0x0070));

  TIMx->CR2 |= TIM_TRGOSource;

CS_CMM_PROBE_NODE_STMT(215,7,1) 
 CODESCROLL_FUNC_END(409, 22, 2201) } CODESCROLL_FUNC_END_RBRACE 
/* # 2215 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SelectSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_SlaveMode)
{ CODESCROLL_FUNC_BEGIN(410, (410, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1036,949) 

  
  CS_CMM_PROBE_NODE_STMT(215,6,0) ((void)0);
  ((void)0);

  TIMx->SMCR &= (uint16_t)~((uint16_t)((uint16_t)0x0007));

  TIMx->SMCR |= TIM_SlaveMode;

CS_CMM_PROBE_NODE_STMT(215,5,1) 
 CODESCROLL_FUNC_END(410, 22, 2224) } CODESCROLL_FUNC_END_RBRACE 
/* # 2236 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SelectMasterSlaveMode(TIM_TypeDef* TIMx, uint16_t TIM_MasterSlaveMode)
{ CODESCROLL_FUNC_BEGIN(411, (411, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1037,950) 

  
  CS_CMM_PROBE_NODE_STMT(215,4,0) ((void)0);
  ((void)0);

  TIMx->SMCR &= (uint16_t)~((uint16_t)((uint16_t)0x0080));


  TIMx->SMCR |= TIM_MasterSlaveMode;

CS_CMM_PROBE_NODE_STMT(215,3,1) 
 CODESCROLL_FUNC_END(411, 22, 2246) } CODESCROLL_FUNC_END_RBRACE 







void TIM_SetCounter(TIM_TypeDef* TIMx, uint16_t Counter)
{ CODESCROLL_FUNC_BEGIN(412, (412, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1038,951) 

  
  CS_CMM_PROBE_NODE_STMT(215,2,0) ((void)0);

  TIMx->CNT = Counter;

CS_CMM_PROBE_NODE_STMT(215,1,1) 
 CODESCROLL_FUNC_END(412, 22, 2260) } CODESCROLL_FUNC_END_RBRACE 







void TIM_SetAutoreload(TIM_TypeDef* TIMx, uint16_t Autoreload)
{ CODESCROLL_FUNC_BEGIN(413, (413, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1039,952) 

  
  CS_CMM_PROBE_NODE_STMT(215,0,0) ((void)0);

  TIMx->ARR = Autoreload;

CS_CMM_PROBE_NODE_STMT(216,7,1) 
 CODESCROLL_FUNC_END(413, 22, 2274) } CODESCROLL_FUNC_END_RBRACE 







void TIM_SetCompare1(TIM_TypeDef* TIMx, uint16_t Compare1)
{ CODESCROLL_FUNC_BEGIN(414, (414, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1040,953) 

  
  CS_CMM_PROBE_NODE_STMT(216,6,0) ((void)0);

  TIMx->CCR1 = Compare1;

CS_CMM_PROBE_NODE_STMT(216,5,1) 
 CODESCROLL_FUNC_END(414, 22, 2288) } CODESCROLL_FUNC_END_RBRACE 







void TIM_SetCompare2(TIM_TypeDef* TIMx, uint16_t Compare2)
{ CODESCROLL_FUNC_BEGIN(415, (415, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1041,954) 

  
  CS_CMM_PROBE_NODE_STMT(216,4,0) ((void)0);

  TIMx->CCR2 = Compare2;

CS_CMM_PROBE_NODE_STMT(216,3,1) 
 CODESCROLL_FUNC_END(415, 22, 2302) } CODESCROLL_FUNC_END_RBRACE 







void TIM_SetCompare3(TIM_TypeDef* TIMx, uint16_t Compare3)
{ CODESCROLL_FUNC_BEGIN(416, (416, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1042,955) 

  
  CS_CMM_PROBE_NODE_STMT(216,2,0) ((void)0);

  TIMx->CCR3 = Compare3;

CS_CMM_PROBE_NODE_STMT(216,1,1) 
 CODESCROLL_FUNC_END(416, 22, 2316) } CODESCROLL_FUNC_END_RBRACE 







void TIM_SetCompare4(TIM_TypeDef* TIMx, uint16_t Compare4)
{ CODESCROLL_FUNC_BEGIN(417, (417, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1043,956) 

  
  CS_CMM_PROBE_NODE_STMT(216,0,0) ((void)0);

  TIMx->CCR4 = Compare4;

CS_CMM_PROBE_NODE_STMT(217,7,1) 
 CODESCROLL_FUNC_END(417, 22, 2330) } CODESCROLL_FUNC_END_RBRACE 
/* # 2343 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SetIC1Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{ CODESCROLL_FUNC_BEGIN(418, (418, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1044,957) 

  
  CS_CMM_PROBE_NODE_STMT(217,6,0) ((void)0);
  ((void)0);

  TIMx->CCMR1 &= (uint16_t)~((uint16_t)((uint16_t)0x000C));

