irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
  TIMx->CCMR1 |= TIM_ICPSC;

CS_CMM_PROBE_NODE_STMT(217,5,1) 
 CODESCROLL_FUNC_END(418, 22, 2352) } CODESCROLL_FUNC_END_RBRACE 
/* # 2365 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SetIC2Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{ CODESCROLL_FUNC_BEGIN(419, (419, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1045,958) 

  
  CS_CMM_PROBE_NODE_STMT(217,4,0) ((void)0);
  ((void)0);

  TIMx->CCMR1 &= (uint16_t)~((uint16_t)((uint16_t)0x0C00));

  TIMx->CCMR1 |= (uint16_t)(TIM_ICPSC << 8);

CS_CMM_PROBE_NODE_STMT(217,3,1) 
 CODESCROLL_FUNC_END(419, 22, 2374) } CODESCROLL_FUNC_END_RBRACE 
/* # 2387 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SetIC3Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{ CODESCROLL_FUNC_BEGIN(420, (420, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1046,959) 

  
  CS_CMM_PROBE_NODE_STMT(217,2,0) ((void)0);
  ((void)0);

  TIMx->CCMR2 &= (uint16_t)~((uint16_t)((uint16_t)0x000C));

  TIMx->CCMR2 |= TIM_ICPSC;

CS_CMM_PROBE_NODE_STMT(217,1,1) 
 CODESCROLL_FUNC_END(420, 22, 2396) } CODESCROLL_FUNC_END_RBRACE 
/* # 2409 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SetIC4Prescaler(TIM_TypeDef* TIMx, uint16_t TIM_ICPSC)
{ CODESCROLL_FUNC_BEGIN(421, (421, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1047,960) 

  
  CS_CMM_PROBE_NODE_STMT(217,0,0) ((void)0);
  ((void)0);

  TIMx->CCMR2 &= (uint16_t)~((uint16_t)((uint16_t)0x0C00));

  TIMx->CCMR2 |= (uint16_t)(TIM_ICPSC << 8);

CS_CMM_PROBE_NODE_STMT(218,7,1) 
 CODESCROLL_FUNC_END(421, 22, 2418) } CODESCROLL_FUNC_END_RBRACE 
/* # 2431 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_SetClockDivision(TIM_TypeDef* TIMx, uint16_t TIM_CKD)
{ CODESCROLL_FUNC_BEGIN(422, (422, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1048,961) 

  
  CS_CMM_PROBE_NODE_STMT(218,6,0) ((void)0);
  ((void)0);

  TIMx->CR1 &= (uint16_t)~((uint16_t)((uint16_t)0x0300));

  TIMx->CR1 |= TIM_CKD;

CS_CMM_PROBE_NODE_STMT(218,5,1) 
 CODESCROLL_FUNC_END(422, 22, 2440) } CODESCROLL_FUNC_END_RBRACE 






uint16_t TIM_GetCapture1(TIM_TypeDef* TIMx)
{ CODESCROLL_FUNC_BEGIN(423, (423, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1049,962) 

  
  CS_CMM_PROBE_NODE_STMT(218,4,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(218,3,1) 
   CODESCROLL_FUNC_END(423, 22, 2452) return TIMx->CCR1;
} CODESCROLL_FUNC_END_RBRACE 






uint16_t TIM_GetCapture2(TIM_TypeDef* TIMx)
{ CODESCROLL_FUNC_BEGIN(424, (424, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1050,963) 

  
  CS_CMM_PROBE_NODE_STMT(218,2,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(218,1,1) 
   CODESCROLL_FUNC_END(424, 22, 2465) return TIMx->CCR2;
} CODESCROLL_FUNC_END_RBRACE 






uint16_t TIM_GetCapture3(TIM_TypeDef* TIMx)
{ CODESCROLL_FUNC_BEGIN(425, (425, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1051,964) 

  
  CS_CMM_PROBE_NODE_STMT(218,0,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(219,7,1) 
   CODESCROLL_FUNC_END(425, 22, 2478) return TIMx->CCR3;
} CODESCROLL_FUNC_END_RBRACE 






uint16_t TIM_GetCapture4(TIM_TypeDef* TIMx)
{ CODESCROLL_FUNC_BEGIN(426, (426, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1052,965) 

  
  CS_CMM_PROBE_NODE_STMT(219,6,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(219,5,1) 
   CODESCROLL_FUNC_END(426, 22, 2491) return TIMx->CCR4;
} CODESCROLL_FUNC_END_RBRACE 






uint16_t TIM_GetCounter(TIM_TypeDef* TIMx)
{ CODESCROLL_FUNC_BEGIN(427, (427, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1053,966) 

  
  CS_CMM_PROBE_NODE_STMT(219,4,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(219,3,1) 
   CODESCROLL_FUNC_END(427, 22, 2504) return TIMx->CNT;
} CODESCROLL_FUNC_END_RBRACE 






uint16_t TIM_GetPrescaler(TIM_TypeDef* TIMx)
{ CODESCROLL_FUNC_BEGIN(428, (428, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1054,967) 

  
  CS_CMM_PROBE_NODE_STMT(219,2,0) ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(219,1,1) 
   CODESCROLL_FUNC_END(428, 22, 2517) return TIMx->PSC;
} CODESCROLL_FUNC_END_RBRACE 
/* # 2546 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
FlagStatus TIM_GetFlagStatus(TIM_TypeDef* TIMx, uint16_t TIM_FLAG)
{ CODESCROLL_FUNC_BEGIN(429, (429, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1055,968) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1056,219,0,0)

  ITStatus bitstatus = RESET;

  ((void)0);
  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(220,7,1) if ((TIMx->SR & TIM_FLAG) != (uint16_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1057,969) 
    
    CS_CMM_PROBE_NODE_STMT(220,6,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable1058,970) 
    
    CS_CMM_PROBE_NODE_STMT(220,5,3) bitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(220,4,4) 
   CODESCROLL_FUNC_END(429, 22, 2561) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 2590 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ClearFlag(TIM_TypeDef* TIMx, uint16_t TIM_FLAG)
{ CODESCROLL_FUNC_BEGIN(430, (430, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1059,971) 

  
  CS_CMM_PROBE_NODE_STMT(220,3,0) ((void)0);
  ((void)0);


  TIMx->SR = (uint16_t)~TIM_FLAG;

