irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_tim_5379_IUT.c
CS_CMM_PROBE_NODE_STMT(220,2,1) 
 CODESCROLL_FUNC_END(430, 22, 2598) } CODESCROLL_FUNC_END_RBRACE 
/* # 2622 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
ITStatus TIM_GetITStatus(TIM_TypeDef* TIMx, uint16_t TIM_IT)
{ CODESCROLL_FUNC_BEGIN(431, (431, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1060,972) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1061,220,1,0)

  ITStatus bitstatus = RESET;
  uint16_t itstatus = 0x0, itenable = 0x0;

  ((void)0);
  ((void)0);

  itstatus = TIMx->SR & TIM_IT;

  itenable = TIMx->DIER & TIM_IT;
  
  CS_CMM_PROBE_NODE_STMT(220,0,1) if (CS_MCDC_431_0((itstatus != (uint16_t)RESET), (itenable != (uint16_t)RESET), 88))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable1062,51) 
    
    CS_CMM_PROBE_NODE_STMT(221,7,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable1063,52) 
    
    CS_CMM_PROBE_NODE_STMT(221,6,3) bitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(221,5,4) 
   CODESCROLL_FUNC_END(431, 22, 2641) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 2666 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
void TIM_ClearITPendingBit(TIM_TypeDef* TIMx, uint16_t TIM_IT)
{ CODESCROLL_FUNC_BEGIN(432, (432, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1064,973) 

  
  CS_CMM_PROBE_NODE_STMT(221,4,0) ((void)0);
  ((void)0);

  TIMx->SR = (uint16_t)~TIM_IT;

CS_CMM_PROBE_NODE_STMT(221,3,1) 
 CODESCROLL_FUNC_END(432, 22, 2673) } CODESCROLL_FUNC_END_RBRACE 
/* # 2691 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
static void TI1_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{ CODESCROLL_FUNC_BEGIN(433, (433, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1065,974) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1066,221,2,0)

  uint16_t tmpccmr1 = 0, tmpccer = 0;

  TIMx->CCER &= (uint16_t)~((uint16_t)((uint16_t)0x0001));
  tmpccmr1 = TIMx->CCMR1;
  tmpccer = TIMx->CCER;

  tmpccmr1 &= (uint16_t)(((uint16_t)~((uint16_t)((uint16_t)0x0003))) & ((uint16_t)~((uint16_t)((uint16_t)0x00F0))));
  tmpccmr1 |= (uint16_t)(TIM_ICSelection | (uint16_t)(TIM_ICFilter << (uint16_t)4));

  tmpccer &= (uint16_t)~((uint16_t)(((uint16_t)0x0002)));
  tmpccer |= (uint16_t)(TIM_ICPolarity | (uint16_t)((uint16_t)0x0001));

  TIMx->CCMR1 = tmpccmr1;
  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(221,1,1) 
 CODESCROLL_FUNC_END(433, 22, 2708) } CODESCROLL_FUNC_END_RBRACE 
/* # 2726 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
static void TI2_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{ CODESCROLL_FUNC_BEGIN(434, (434, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1067,975) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1068,221,0,0)

  uint16_t tmpccmr1 = 0, tmpccer = 0, tmp = 0;

  TIMx->CCER &= (uint16_t)~((uint16_t)((uint16_t)0x0010));
  tmpccmr1 = TIMx->CCMR1;
  tmpccer = TIMx->CCER;
  tmp = (uint16_t)(TIM_ICPolarity << 4);

  tmpccmr1 &= (uint16_t)(((uint16_t)~((uint16_t)((uint16_t)0x0300))) & ((uint16_t)~((uint16_t)((uint16_t)0xF000))));
  tmpccmr1 |= (uint16_t)(TIM_ICFilter << 12);
  tmpccmr1 |= (uint16_t)(TIM_ICSelection << 8);

   tmpccer &= (uint16_t)~((uint16_t)(((uint16_t)0x0020)));
  tmpccer |= (uint16_t)(tmp | (uint16_t)((uint16_t)0x0010));

  TIMx->CCMR1 = tmpccmr1 ;
  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(222,7,1) 
 CODESCROLL_FUNC_END(434, 22, 2745) } CODESCROLL_FUNC_END_RBRACE 
/* # 2763 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
static void TI3_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{ CODESCROLL_FUNC_BEGIN(435, (435, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1069,976) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1070,222,6,0)

  uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;

  TIMx->CCER &= (uint16_t)~((uint16_t)((uint16_t)0x0100));
  tmpccmr2 = TIMx->CCMR2;
  tmpccer = TIMx->CCER;
  tmp = (uint16_t)(TIM_ICPolarity << 8);

  tmpccmr2 &= (uint16_t)(((uint16_t)~((uint16_t)((uint16_t)0x0003))) & ((uint16_t)~((uint16_t)((uint16_t)0x00F0))));
  tmpccmr2 |= (uint16_t)(TIM_ICSelection | (uint16_t)(TIM_ICFilter << (uint16_t)4));

  tmpccer &= (uint16_t)~((uint16_t)(((uint16_t)0x0200)));
  tmpccer |= (uint16_t)(tmp | (uint16_t)((uint16_t)0x0100));

  TIMx->CCMR2 = tmpccmr2;
  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(222,5,1) 
 CODESCROLL_FUNC_END(435, 22, 2781) } CODESCROLL_FUNC_END_RBRACE 
/* # 2799 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_tim.c"*/
static void TI4_Config(TIM_TypeDef* TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{ CODESCROLL_FUNC_BEGIN(436, (436, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable1071,977) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable1072,222,4,0)

  uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;


  TIMx->CCER &= (uint16_t)~((uint16_t)((uint16_t)0x1000));
  tmpccmr2 = TIMx->CCMR2;
  tmpccer = TIMx->CCER;
  tmp = (uint16_t)(TIM_ICPolarity << 12);

  tmpccmr2 &= (uint16_t)((uint16_t)(~(uint16_t)((uint16_t)0x0300)) & ((uint16_t)~((uint16_t)((uint16_t)0xF000))));
  tmpccmr2 |= (uint16_t)(TIM_ICSelection << 8);
  tmpccmr2 |= (uint16_t)(TIM_ICFilter << 12);


  tmpccer &= (uint16_t)~((uint16_t)(((uint16_t)0x2000)));
  tmpccer |= (uint16_t)(tmp | (uint16_t)((uint16_t)0x1000));

  TIMx->CCMR2 = tmpccmr2;
  TIMx->CCER = tmpccer;

CS_CMM_PROBE_NODE_STMT(222,3,1) 
 CODESCROLL_FUNC_END(436, 22, 2820) } CODESCROLL_FUNC_END_RBRACE 
